/*
 * tools.h
 * Author: Jesus Diaz Garcia
 *
 * Single file library with several utilities among the following:
 * - Platform identification
 * - Assertions, debugging, errors, logging
 * - Aliases for sized types
 * - Intrinsics
 * - Strings
 * - Hashing
 * - Memory allocators
 * - Image loading
 * - File/directory/path management
 * - Process execution
 * - Dynamic library loading
 * - Mathematics
 * - Clock / timing
 * - Window creation
 * - Input handling (mouse and keyboard)
 * - Audio
 */

#ifndef TOOLS_H
#define TOOLS_H

////////////////////////////////////////////////////////////////////////////////////////////////////
// Platform definitions

#if _WIN32
#	define PLATFORM_WINDOWS 1
#elif __ANDROID__
#	define PLATFORM_ANDROID 1
#elif __linux__
#	define PLATFORM_LINUX 1
#elif __APPLE__
#	define PLATFORM_APPLE 1
#else
#	error "Unsupported platform"
#endif


#if PLATFORM_WINDOWS || PLATFORM_LINUX
#define USE_IMGUI 0
#endif


#if PLATFORM_WINDOWS

#define NOMINMAX
#define WIN32_LEAN_AND_MEAN
#include <Windows.h>
#include <WindowsX.h>
#include <xinput.h>
#include <mmsystem.h> // audio
#include <dsound.h>   // audio
#include <direct.h>   // _getcwd
#include <intrin.h>   // _WriteBarrier
#undef Yield          // Empty macro defined in winbase.h
#elif PLATFORM_LINUX || PLATFORM_ANDROID
#include <time.h>     // TODO: Find out if this header belongs to the C runtime library...
#include <sys/stat.h> // stat
#include <fcntl.h>    // open
#include <unistd.h>   // read, close, getcwd
#include <string.h>   // strerror_r
#include <errno.h>    // errno
#include <sys/mman.h> // mmap
#include <dirent.h>   // opendir/readdir/closedir
#include <pthread.h>
#include <semaphore.h>
#endif

#if PLATFORM_LINUX || PLATFORM_ANDROID
#include <sys/wait.h>
#include <spawn.h>
#include <dlfcn.h>
#endif

#if PLATFORM_LINUX
#define ALSA_PCM_NEW_HW_PARAMS_API
#include <alsa/asoundlib.h>
#include <linux/ioctl.h> // ioctl
#include <linux/input.h> // input_event
#endif

#if PLATFORM_ANDROID
#include <android/sensor.h>
#include <android/log.h>
#include <android_native_app_glue.h>
#include <aaudio/AAudio.h>
#endif


#include <stdio.h>  // printf
#include <stdarg.h>
#include <math.h>
// TODO: Remove C runtime library includes. But first...
// TODO: Remove calls to printf.



////////////////////////////////////////////////////////////////////////////////////////////////////
// Useful defines

#define internal static

#define KB(x) (1024ul * x)
#define MB(x) (1024ul * KB(x))
#define GB(x) (1024ul * MB(x))
#define TB(x) (1024ul * GB(x))

#define MAX_PATH_LENGTH 512

#if PLATFORM_ANDROID
#define Debug ANDROID_LOG_DEBUG
#define Info ANDROID_LOG_INFO
#define Warning ANDROID_LOG_WARN
#define Error ANDROID_LOG_ERROR
#define LOG(channel, fmt, ...) ((void)__android_log_print(channel, "tools", fmt, ##__VA_ARGS__))
#else
#define Debug 0
#define Info 1
#define Warning 2
#define Error 3
#define LOG(channel, fmt, ...) printf(fmt, ##__VA_ARGS__)
#endif

#if PLATFORM_ANDROID
#define QUIT_ABNORMALLY() __builtin_trap();
#else
#define QUIT_ABNORMALLY() *((int*)0) = 0;
#endif

#define ASSERT(expression) if ( !(expression) ) { \
		LOG(Error, "%s", "Assertion failed: ASSERT( " #expression " )\n" ); \
		QUIT_ABNORMALLY(); \
	}
#define ASSERTMSG(expression, message, ...) if ( !(expression) ) { \
		LOG(Error, "Assertion failed: ASSERT(" #expression " )\nAssertion message: " message, __VA_ARGS__); \
		QUIT_ABNORMALLY(); \
	}
#define INVALID_CODE_PATH() ASSERT(0 && "Invalid code path")
#define INVALID_CODE_PATH_MSG(message) ASSERT(0 && message)
#define ARRAY_COUNT(array) (sizeof(array)/sizeof(array[0]))

#define CT_ASSERT3(expression, number) static int ct_assert_##number[(expression) ? 1 : -1]
#define CT_ASSERT2(expression, number) CT_ASSERT3(expression, number)
#define CT_ASSERT(expression) CT_ASSERT2(expression, __COUNTER__)



////////////////////////////////////////////////////////////////////////////////////////////////////
// Sized types

typedef char i8;
typedef short int i16;
typedef int i32;
typedef long long int i64;
typedef unsigned char u8;
typedef unsigned short int u16;
typedef unsigned int u32;
typedef unsigned long long int u64;
typedef float f32;
typedef double f64;
typedef	unsigned char byte;

CT_ASSERT(sizeof(i8) == 1);
CT_ASSERT(sizeof(i16) == 2);
CT_ASSERT(sizeof(i32) == 4);
CT_ASSERT(sizeof(i64) == 8);
CT_ASSERT(sizeof(u8) == 1);
CT_ASSERT(sizeof(u16) == 2);
CT_ASSERT(sizeof(u32) == 4);
CT_ASSERT(sizeof(u64) == 8);
CT_ASSERT(sizeof(f32) == 4);
CT_ASSERT(sizeof(f64) == 8);
CT_ASSERT(sizeof(byte) == 1);

#define I8_MAX 128
#define U8_MAX 255
#define I16_MAX 32767
#define U16_MAX 65535
#define I32_MAX 2147483647
#define U32_MAX 4294967295

#if PLATFORM_WINDOWS
CT_ASSERT(sizeof(long) == sizeof(i32));
typedef volatile LONG volatile_i32;
typedef volatile ULONG volatile_u32;
typedef volatile LONG64 volatile_i64;
#else
typedef volatile i32 volatile_i32;
typedef volatile u32 volatile_u32;
typedef volatile i64 volatile_i64;
#endif



////////////////////////////////////////////////////////////////////////////////////////////////////
// Truncations

u32 U64ToU32(u64 value)
{
	ASSERT(value <= U32_MAX);
	const u32 res = (u64)value;
	return res;
}

u16 I32ToU16(i32 value)
{
	ASSERT( value >= 0 && value < U16_MAX );
	const u16 res = (u16)value;
	return res;
}

u8 I32ToU8(i32 value)
{
	ASSERT( value >= 0 && value < U8_MAX );
	const u8 res = (u8)value;
	return res;
}



////////////////////////////////////////////////////////////////////////////////////////////////////
